{
    "class_name": "Sequential",
    "config": {
        "name": "sequential",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [null, 256, 256, 1],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_layer"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [3, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true
                }
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d",
                    "pool_size": [2, 2],
                    "padding": "valid",
                    "strides": [2, 2],
                    "data_format": "channels_last"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [3, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true
                }
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d_1",
                    "pool_size": [2, 2],
                    "padding": "valid",
                    "strides": [2, 2],
                    "data_format": "channels_last"
                }
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout",
                    "rate": 0.5
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_size": [3, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true
                }
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d_2",
                    "pool_size": [2, 2],
                    "padding": "valid",
                    "strides": [2, 2],
                    "data_format": "channels_last"
                }
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_1",
                    "rate": 0.5
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_3",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [3, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true
                }
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d_3",
                    "pool_size": [2, 2],
                    "padding": "valid",
                    "strides": [2, 2],
                    "data_format": "channels_last"
                }
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_2",
                    "rate": 0.5
                }
            },
            {
                "class_name": "Flatten",
                "config": {
                    "name": "flatten"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense",
                    "units": 256,
                    "activation": "relu",
                    "use_bias": true
                }
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_3",
                    "rate": 0.5
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_1",
                    "units": 1,
                    "activation": "sigmoid",
                    "use_bias": true
                }
            }
        ]
    }
}