{
    "class_name": "Sequential",
    "config": {
        "name": "sequential",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "input_shape": [250, 550, 1],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "convo_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [3, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "activation": "relu"
                }
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d_1",
                    "pool_size": [2, 2],
                    "strides": [2, 2],
                    "padding": "valid"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "convo_2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [3, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "activation": "relu"
                }
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d_2",
                    "pool_size": [2, 2],
                    "strides": [2, 2],
                    "padding": "valid"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "convo_3",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_size": [3, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "activation": "relu"
                }
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d_3",
                    "pool_size": [2, 2],
                    "strides": [2, 2],
                    "padding": "valid"
                }
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_1",
                    "rate": 0.5
                }
            },
            {
                "class_name": "Flatten",
                "config": {
                    "name": "flatten"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_1",
                    "units": 128,
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_2",
                    "rate": 0.5
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_2",
                    "units": 1,
                    "activation": "sigmoid"
                }
            }
        ]
    }
}